---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ConnectorIndex
source: html/f204c759-124b-7d35-ec66-03e6b6b934ad.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ConnectorIndex Property

"Index"

## Syntax (C#)
```csharp
public static ForgeTypeId ConnectorIndex { get; }
```